---
kind: type
id: T:Autodesk.Revit.DB.ParameterValuePresenceRule
source: html/20b7bd3d-6326-9b47-0738-9da761e3fcf5.htm
---
# Autodesk.Revit.DB.ParameterValuePresenceRule

Tests whether an element's parameter has a value or not.

## Syntax (C#)
```csharp
public class ParameterValuePresenceRule : FilterRule
```